'use streict'

/*
детерминированная фуктия - выдается одинаковый результат из определенного начального состояния.
фуктия, которая которая производит тот же результат при отдиаковых вводных данных.

чистые фукции - предсказуемые, прозрачные. Такие фуктии близки к математическим (х в квадрате с одним и тем же значением х, всегда будет давать одинаковый результат, а вычесления квадрата х не будет менять сам х.)

недетерминированная функтия - непредсказуемая, ее результат зависит от чего-то еще.
math.random(); - генератор случайных чисел.

Побочные эффекты 
console.log();

вывод на экран - просто действие, что выполняет фуктия.
но она так же возвращает значение - всегда undefined. 
*/