"use streict"

/*
типизация - классификация инфрмации

Number("590"); // 590
Number("aaa!!"); // NaN
Boolean(1); // true
boolean(0); // folse
String(true); // "true"
String("false"); //"false"
string(44800); // "44800"

let a; // переменная без значения имеет тип undefined.

let a = null; // нужен для намереного указания что значения нет.


Динамическая и статическая(когда?)
код конвертируется в понятную для запуска компьютером форму - компеляция
промежуток времени, закоторый это происходти - стадия компиляции (compile time)

1) проверка типов и поиск ошибок на стадии компеляции (статическая типизация). перед запуском прогграмы (C#, C++ Java)
2) проверка типов и поиск ошибок на стадии исполнения (динамическая типизация). в переод исполнения программы (JS, php ruby)

слабая и сильная (на сколько серьезно?)

1) 4 * '7' - JS имеет прелстовления о типах данных. У него слабая типизация.

*/